<?php
//**---------------------------------------------------------------------+
//**  LYECS 设置项模型
//**---------------------------------------------------------------------+
//**   版权所有：江西禹商科技有限公司. 官网：https://www.lyecs.com
//**---------------------------------------------------------------------+
//**   作者：老杨(YangQiang) yq@lyecs.com
//**---------------------------------------------------------------------+
//**   提示：LYECS商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
//**---------------------------------------------------------------------+

namespace app\model\setting;

use think\Model;

class Config extends Model
{
    protected $pk = 'id';
    protected $table = 'config';
    protected $json = ['data'];
    // 设置JSON数据返回数组
    protected $jsonAssoc = true;
}
