<?php

return [
    'refund_status'  => [
    	'0'=>'未处理',
    	'1'=>'已处理',
    	'2'=>'已取消',
    ],
    'data type error' => '数据类型错误',
    'return_type'  => [
    	'1'=>'退货/退款',
    	'2'=>'换货',
    	'3'=>'其它',
    ],
    'return_status'  => [
    	'1'=>'售后正在审核处理',
    	'2'=>'售后审核通过,待处理',
    	'3'=>'售后审核未通过',
    	'4'=>'售后要求寄回',
    	'5'=>'快递已寄回',
    	'6'=>'售后已完成',
    ],
    'order'  => [
		'total_fee'=>'订单总金额',
		'paid_fee'=>'已付款金额',
		'unpay_fee'=>'待付款金额',
		'goods_amount'=>'商品总金额',
		'discount'=>'折扣',
		'bonus'=>'优惠券',
		'integral_money'=>'积分',
		'shipping_fee'=>'运费',
		'tax'=>'发票',
		'insure_fee'=>'保价费',
		'pay_fee'=>'支付手续费',
		'pack_fee'=>'包装费',
		'card_fee'=>'礼品卡',
		'balance_amount'=>'尾款',
		'money_paid'=>'实收金额',
		'surplus'=>'余额',
		'beans'=>'爱心豆',
    ],
/*admin/lottery.php
* pc/lottery.php
*/ 
    'lottery_type'  => [
        '1'=>'线上商品',
        '2'=>'红包',
        '3'=>'积分',
        '4'=>'余额',
        '5'=>'线下实物',
        '6'=>'啥也没抽到',
    ],
    'lottery_status'  => [
        '0'=>'未处理，未填写信息',
        '1'=>'奖品已发放',
        '2'=>'信息待审核、确认',
        '3'=>'审核失败',
        '4'=>'已确认信息，待发放奖品',
        '5'=>'无效',
    ],
/*admin/mail_template.php
*/ 
    'mail_template'  => [
        'order_confirm'      =>'订单确认模板',
        'deliver_notice'     =>'发货通知模板',
        'send_password'      =>'发送密码模板',
        'order_cancel'       =>'订单取消模板',
        'order_invalid'      =>'订单无效模板',
        'send_bonus'         =>'发送红包模板',
        'group_buy'          =>'团购商品模板',
        'register_validate'  =>'邮件验证模板',
        'virtual_card'       =>'虚拟卡片模板',
        'attention_list'     =>'关注管理',
        'remind_of_new_order'=>'新订单提醒模板',
        'goods_booking'      =>'缺货回复模板',
        'user_message'       =>'留言回复模板',
        'recomment'          =>'用户评论回复模板',
        'order_pay_email'    =>'订单付款通知',
    ],
/*admin/navigator.php
*/ 
    'navigator_type'  => [
        'top'   =>'顶部',
        'middle'=>'中间',
        'bottom'=>'底部',
    ],
/*admin/order.php
*/ 
    'pay_type'  => [
        '0'=>'在线支付',
        '1'=>'货到付款',
        '2'=>'线下支付'
    ],
/*admin/sitemap.php
*/ 
    'priority'  => [
        'always' => '一直更新',
        'hourly' => '小时',
        'daily'  => '天',
        'weekly' => '周',
        'monthly'=> '月',
        'yearly' => '年',
        'never'  => '从不更新',
    ],
/*admin/user_account.php
*/ 
    'surplus_type'  => [
        '0' => '充值',
        '1' => '提现',
    ],
/*admin/user_account.php
*/ 
    'user_msg_type'  => [
        '0' => '建议',
        '1' => '投诉',
        '2' => '商品',
        '3' => '其它',
        '4' => '店铺投诉',
        '5' => '订单问题',
    ],



/*goods/price.php*/ 
    'request_error'=>'请求发生错误',
/*member/account.php*/ 
    'account_title'=>'资金管理',
    'account_reply_title'=>'充值提现',
    'zh_frozen_money'=>'冻结金',
    'pay_error_content'=>'支付错误，此申请不存在或已付款！',
    'pay_error_not_exit'=>'支付错误，此申请不存在！',
    'pay_error_already_paid'=>'支付错误，此申请已付款！',
    'pay_error_not_select_payment'=>'支付错误，未选择支付方式！',
    'pay_error_payment_not_exit'=>'支付方式不存在！',
    'select_zfb_account'=>'请选择支付宝账号...',
    'select_yhk_account'=>'请选择银行卡号...',
    'account_not_exit'=>'账号不存在！',
    'please_input_reply_amount'=>'请输入提现金额！',
    'reply_amount_not_lt100'=>'提现金额不得小于100！',
    'repay_apply'=>'提现申请',
    'add_repay_error'=>'添加的提现方式错误！',
    'add_zfb_account'=>'添加支付宝账户',
    'add_yhk_account'=>'添加银行卡号',
    'add_account_not_empty'=>'添加的账号不能为空！',
    'account_exit'=>'此号码已存在，请重新核实！',
    'add_success'=>'添加成功',
    'back_repay'=>'返回提现',
/*member/address.php*/ 
//  'label_address'=>'收货地址';//lang/user.php,
    'label_china'=>'中国',
    'label_province'=>'省',
    'label_city'=>'市',



/*member/user.php*/ 
    'o_status'  => [
        '1'  => '待付款',
        '2'  => '已提交',
        '3'  => '支付尾款',
        '4'  => '已提交',
        '5'  => '配货中',
        '6'  => '已发货',
        '7'  => '已收货',
        '8'  => '退货处理',
        '9'  => '待发货',
        '10' => '已完成',
        '11' => '已取消',
        '12' => '无效订单',
        '13' => '已发货（部分）',
        '14' => '捡货待发',
        '20' => '已取消，待退款',
    ],
    'o_status_info'  => [
        '1'  => '您的订单已提交成功，请尽快完成付款哦！',
        '2'  => '感谢您在本店的购物，您的订单已提交成功，我们会尽快为您发货！',
        '3'  => '感谢您在本店的购物，您的订单已提交成功，请尽快完成付款哦！',
        '4'  => '感谢您在本店的购物，您的订单已提交成功，我们会尽快为您发货！',
        '5'  => '您的订单正在加紧配货当中，我们会尽快为您进行发货处理，感谢您的耐心等待！',
        '6'  => '您的订单已经发货，请注意查收，祝您购物愉快！',
        '7'  => '您的订单已经确认收货，感谢您在本店购物，祝您生活愉快！',
        '8'  => '您的订单已经退货，感谢您在本店的购物，给您造成的不便请多多谅解！',
        '9'  => '您的订单正在加紧发货中，祝您购物愉快！',
        '10' => '您的订单已经确认完成，感谢您在本店购物，祝您生活愉快！',
        '11' => '您的订单已被取消，您可以通过"再次购买"，重新购买订单中的商品。',
        '12' => '您的订单被认定为无效订单，订单已被关闭。您可以通过"再次购买"，重新购买订单中的商品。给您造成的不便请多多谅解！',
        '13' => '您的订单已经部分发货，未发货的商品我们会及时补发，祝您购物愉快！',
        '14' => '您的订单已捡货待发，感谢您在本店的购物，注您购物愉快！',
        '20' => '您的订单已取消，待退款！',
    ],

    'affiliate_stats'  => [
        '0'              => '等待处理',
        '1'              => '已分成',
        '2'              => '取消分成',
        '3'              => '已撤销',
        '4'              => '等待买家付款',
    ],
/*member/affiliate_order.php*/ 
    'affiliate_intro'  => [
        '0' => '　　本网店为鼓励推荐新用户注册，现开展<b>推荐注册分成</b>活动，活动流程如下：

        　　１、将本站提供给您的推荐代码，发送到论坛、博客上。
        　　２、访问者点击链接，访问网店。
        　　３、在访问者点击链接的 <b>%d%s</b> 内，若该访问者在本站注册，即认定该用户是您推荐的，您将获得等级积分 <b>%d</b> 的奖励 (当您的等级积分超过 <b>%d</b> 时，不再获得奖励)。
        　　４、该用户今后在本站的一切消费，您均能获得一定比例的提成。目前实行的提成总额为订单金额的 <b>%s</b> 、积分的 <b>%s</b> ，分配给您、推荐您的人等，具体分配规则请参阅 <b><a href="#myrecommend">我推荐的会员</a></b>。
        　　５、提成由管理员人工审核发放，请您耐心等待。
        　　６、您可以通过分成明细来查看您的介绍、分成情况。',
        '1' => '　　本网店为鼓励推荐新用户注册，现开展<b>推荐订单分成</b>活动，活动流程如下：

        　　１、在浏览商品时，点击推荐此商品，获得推荐代码，将其发送到论坛、博客上。
        　　２、访问者点击链接，访问网店。
        　　３、在访问者点击链接的 <b>%d%s</b> 内，若该访问者在本站有订单，即认定该订单是您推荐的。
        　　４、您将获得该订单金额的 <b>%s</b> 、积分的 <b>%s</b>的奖励。
        　　５、提成由管理员人工审核发放，请您耐心等待。
        　　６、您可以通过分成明细来查看您的介绍、分成情况。',
    ],
/*member/affiliate_order.php*/ 
    'expire_unit'  => [
        'hour'     => '小时',
        'day'      => '天',
        'week'     => '周',
    ],
    'passwd_questions'  => [
        /* 密码找回问题 */
        'friend_birthday' => '我最好朋友的生日？',
        'old_address'     => '我儿时居住地的地址？',
        'motto'           => '我的座右铭是？',
        'favorite_movie'  => '我最喜爱的电影？',
        'favorite_song'   => '我最喜爱的歌曲？',
        'favorite_food'   => '我最喜爱的食物？',
        'interest'        => '我最大的爱好？',
        'favorite_novel'  => '我最喜欢的小说？',
        'favorite_equipe' => '我最喜欢的运动队？',
    ],
    'oos'  => [
        /* 缺货处理 */
        '0'               => '商家默认',
        '1'               => '等待所有商品备齐后再发',
        '2'               => '取消订单',
        '3'               => '与店主协商',
    ],
    'message_type'  => [
        '0'         => '留言',
        '1'         => '投诉',
        '2'         => '询问',
        '3'         => '售后',
        '4'         => '求购',
        '5'         => '商家留言',
        '6'         => '评论',
    ],

];














