<?php
//**---------------------------------------------------------------------+
//** 验证器文件 -- 评论晒单
//**---------------------------------------------------------------------+
//** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
//**---------------------------------------------------------------------+
//** 作者：Tigshop团队，yq@tigshop.com
//**---------------------------------------------------------------------+
//** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
//**---------------------------------------------------------------------+

namespace app\validate\product;

use think\Validate;

class CommentValidate extends Validate
{
    protected $rule = [
        'content' => 'require|max:500',
    ];

    protected $message = [
        'content.require' => '评论内容不能为空',
        'content.max' => '评论名称最多500个字符',
    ];

    protected $scene = [
        'create' => ['content'],
        'update' => ['content'],
    ];
}
