<?php
//**---------------------------------------------------------------------+
//** 验证器文件 -- 商品规格
//**---------------------------------------------------------------------+
//** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
//**---------------------------------------------------------------------+
//** 作者：Tigshop团队，yq@tigshop.com
//**---------------------------------------------------------------------+
//** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
//**---------------------------------------------------------------------+

namespace app\validate\product;

use think\Validate;

class ProductSpecsValidate extends Validate
{
    protected $rule = [
    ];

    protected $message = [
    ];
}
