<?php
//**---------------------------------------------------------------------+
//** 服务层文件 -- 物流
//**---------------------------------------------------------------------+
//** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
//**---------------------------------------------------------------------+
//** 作者：Tigshop团队，yq@tigshop.com
//**---------------------------------------------------------------------+
//** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
//**---------------------------------------------------------------------+

namespace app\service\shipping;

use app\service\BaseService;

/**
 * 物流服务类
 */
class ShippingService extends BaseService
{

    public function __construct()
    {
    }

}
