<?php
//**---------------------------------------------------------------------+
//** 验证器文件 -- 计划任务
//**---------------------------------------------------------------------+
//** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
//**---------------------------------------------------------------------+
//** 作者：Tigshop团队，yq@tigshop.com
//**---------------------------------------------------------------------+
//** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
//**---------------------------------------------------------------------+

namespace app\validate\setting;

use think\Validate;

class CronsValidate extends Validate
{
    protected $rule = [
        'cron_name' => 'require|max:100',
    ];

    protected $message = [
        'cron_name.require' => '计划任务名称不能为空',
        'cron_name.max' => '计划任务名称最多100个字符',
    ];

    protected $scene = [
        'create' => [
            'cron_name',
        ],
        'update' => [
            'cron_name',
        ],
    ];
}
