<?php
//**---------------------------------------------------------------------+
//** 验证器文件 -- 相册图片
//**---------------------------------------------------------------------+
//** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
//**---------------------------------------------------------------------+
//** 作者：Tigshop团队，yq@tigshop.com
//**---------------------------------------------------------------------+
//** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
//**---------------------------------------------------------------------+

namespace app\validate\setting;

use think\Validate;

class GalleryPicValidate extends Validate
{
    protected $rule = [
        'pic_name' => 'require|max:100',
    ];

    protected $message = [
        'pic_name.require' => '相册图片名称不能为空',
        'pic_name.max' => '相册图片名称最多100个字符',
    ];

    protected $scene = [
        'create' => [
            'pic_name',
        ],
        'update' => [
            'pic_name',
        ],
    ];
}
