<?php
//**---------------------------------------------------------------------+
//** 验证器文件 -- 消息设置
//**---------------------------------------------------------------------+
//** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
//**---------------------------------------------------------------------+
//** 作者：Tigshop团队，yq@tigshop.com
//**---------------------------------------------------------------------+
//** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
//**---------------------------------------------------------------------+

namespace app\validate\setting;

use think\Validate;

class MessageTypeValidate extends Validate
{
    protected $rule = [
//        'name' => 'require|max:100',
    ];

    protected $message = [
        'name.require' => '消息设置名称不能为空',
        'name.max' => '消息设置名称最多100个字符',
    ];
}
