<?php
//**---------------------------------------------------------------------+
//** 验证器文件 -- 秒杀
//**---------------------------------------------------------------------+
//** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
//**---------------------------------------------------------------------+
//** 作者：Tigshop团队，yq@tigshop.com
//**---------------------------------------------------------------------+
//** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
//**---------------------------------------------------------------------+

namespace app\validate\promotion;

use think\Validate;

class FlashSaleValidate extends Validate
{
    protected $rule = [
        'flash_sale_name' => 'require|max:100',
    ];

    protected $message = [
        'flash_sale_name.require' => '秒杀名称不能为空',
        'flash_sale_name.max' => '秒杀名称最多100个字符',
    ];
}
