<?php
//**---------------------------------------------------------------------+
//** 验证器文件 -- 店铺
//**---------------------------------------------------------------------+
//** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
//**---------------------------------------------------------------------+
//** 作者：Tigshop团队，yq@tigshop.com
//**---------------------------------------------------------------------+
//** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
//**---------------------------------------------------------------------+

namespace app\validate\shop;

use think\Validate;

class ShopValidate extends Validate
{
    protected $rule = [
        'store_title' => 'require|max:100',
    ];

    protected $message = [
        'store_title.require' => '店铺名称不能为空',
        'store_title.max' => '店铺名称最多100个字符',
    ];
}
